{
  "army_rule": {
    "rule_name": "Nurgle's Gift (Aura)",
    "description": "If your Army Faction is DEATH GUARD, while an enemy unit is within Contagion Range of one or more Death Guard units from your army, it is Afflicted.",
    "contagion_range_scaling": [
      {
        "battle_round": 1,
        "range": "3\""
      },
      {
        "battle_round": 2,
        "range": "6\""
      },
      {
        "battle_round": "3+",
        "range": "9\""
      }
    ],
    "afflicted_effect": {
      "base_effect": "Subtract 1 from the Toughness characteristic of models in that unit.",
      "plague_selection_intro": "During the Declare Battle Formations step, select one of the Plagues below. Until the end of the battle, while an enemy unit is Afflicted, it also has the effect of your chosen Plague.",
      "plagues": [
        {
          "plague_name": "Skullsquirm Blight",
          "description": "Each time a model in this unit makes an attack, subtract 1 from the Hit roll."
        },
        {
          "plague_name": "Rattlejoint Ague",
          "description": "Worsen the Save characteristic of models in this unit by 1."
        },
        {
          "plague_name": "Scabrous Soulrot",
          "description": "Worsen the Move, Leadership and Objective Control characteristics of models in this unit by 1 (this rule can only worsen a model's Objective Control characteristic to a minimum of 1)."
        }
      ]
    }
  },
  "detachments": [
    {
      "detachment_name": "Champions of Contagion",
      "rule_name": "Manifold Maladies",
      "description": "At the start of the battle round, you can select one of the Plagues listed in Nurgle's Gift. Until the end of the battle, that is your chosen Plague instead of any previously chosen Plague."
    },
    {
      "detachment_name": "Death Lord's Chosen",
      "rule_name": "Deadly Vectors",
      "description": "In your opponent's Command phase, roll 2D6 for each Afflicted enemy unit, subtracting 1 from the result if that unit is Below Half-strength. If the result is 6 or less, that enemy unit suffers D3 mortal wounds."
    },
    {
      "detachment_name": "Flyblown Host",
      "rule_name": "Verminous Haze",
      "description": "Death Guard Infantry units (excluding Poxwalkers units) from your army that are not embarked within a Transport have the Scouts 5\" and Stealth abilities."
    },
    {
      "detachment_name": "Mortarion's Hammer",
      "rule_name": "Miasmic Bombardment",
      "description": "At the start of the battle round, select a number of enemy units more than 12\" away from every model in your army that is on the battle field. Until the end of the battle round, those enemy units are Afflicted. The maximum number of units you can select in this way depends on the battle size, as shown below.",
      "selection_limits_by_battle_size": [
        {
          "battle_size": "Incursion",
          "max_units": 1
        },
        {
          "battle_size": "Strike Force",
          "max_units": 2
        },
        {
          "battle_size": "Onslaught",
          "max_units": 3
        }
      ]
    },
    {
      "detachment_name": "Shamblerot Vectorium",
      "rule_name": "Numberless Horde",
      "description": "In your Command phase in each of the following battle rounds, depending on your chosen battle size, add a new Poxwalkers unit with a Starting Strength of 10 to your army, in Strategic Reserves.",
      "reinforcement_schedule_by_battle_size": [
        {
          "battle_size": "Incursion",
          "battle_rounds": "2,3"
        },
        {
          "battle_size": "Strike Force",
          "battle_rounds": "2,3,4"
        },
        {
          "battle_size": "Onslaught",
          "battle_rounds": "2,3,4,5"
        }
      ],
      "additional_effect": "Poxwalkers units from your army gain the Battleline keyword."
    },
    {
      "detachment_name": "Tallyband Summoners",
      "rule_name": "Reverberant Rancidity",
      "description": "While a Plague Legions unit from your army is within 7\" of one or more Death Guard units from your army, that Plague Legions unit has the Nurgle's Gift ability. While a Death Guard unit from your army is within 7\" of one or more Plague Legions units from your army, add 3\" to that Death Guard unit's Contagion Range."
    },
    {
      "detachment_name": "Virulent Vectorium",
      "rule_name": "Worldblight",
      "description": "If you control an objective marker at the end of your Command phase and a Death Guard unit from your army (excluding Battle-shocked units) is within range of that objective marker, that objective marker remains under your control until your opponent's Level of Control over that objective marker is greater than yours at the end of a phase. In addition, until you lose control of that objective marker, it has the Nurgle's Gift ability as if it were a Death Guard unit from your army."
    }
  ]
}